In [ ]:
==================== Data Analysis =============================
1. Pandas         :  Data frame analysis
2. Numpy          :  Numerical analysis
3. matplotlib     :  Graphs and plots
4. seaborn        :  plots
5. Bokhe         :   plots
6. plotly         :  plots

=================== Machine Learning ============================
7. stats          : for statistical models
8. scikit-learn(sklearn) :  ML models

===================  Deep learning ============================
9. opencv         : Computer vision
10. pillow        : Image operations
11. tensorflow    : Neural Network creations (developed by google)
12. keras         : NN
13. pytorch       : alternative package of tensorflow (facebook meta)

==================== NLP ========================================
14. NLTK          : Natural language toolkit
15. SpaCy         : Alternative to NLTK
16. wordcloud     : most frequent occured words       

======================= Scarapping =================================
17. SqLite        : Data base creation
18. Beautiful soup
19. Selenium

======================== API creations ===========================
20. Flask
21. FastAPI
22. Gradio
23. Django
======================= UI app creation =========================
24.Streamlit

===================== Transfer learning models(DL) ===========
25. Mobilenet
26. Resnet
27. VGGnet
28. Inception
29. Yolo    :  Ultralytics

===================== Transfer learning models(NLP) ===========
30. Word2vec
31. GloVe

======================== Hugging Face Transformers ===============
32. BERT   : Bi Directional Encoder representation of Transformers

========================== Allen NLP =======================
33. Allen NLP packages

================== GenAI =============================
34. LangChain
35. Google GeminiAi realted pcakges
36. OpenAI GPT realted packages
37. Amazon BedRock realted packages
38. Meta Llama  related packages

==================== Image and Video Generations ==============
39. GAN models realted packages
40. SORA related packages
41. nano banana

=================== Model deployment (MlOps)===================
41. mlflow using databricks
42. kubeflow (GCP account)

==================== Cloud applications =====================
43. Azure ML realted packages
44. GCP VertexAI related packages
45. AWS Sagemaker realted packages

==================== small ===================================
46. time
47. logging
48. math
49. random
50. env
51. os

**Step-1: Import packages**

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
Init signature:
pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'
Docstring:     
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order. If a dict contains Series
    which have an index defined, it is aligned by its index. This alignment also
    occurs if data is a Series or a DataFrame itself. Alignment is done on
    Series/DataFrame inputs.

    If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame when data does not have them,
    defaulting to RangeIndex(0, 1, 2, ..., n). If data contains column labels,
    will perform column selection instead.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool or None, default None
    Copy data from inputs.
    For dict data, the default of None behaves like ``copy=True``.  For DataFrame
    or 2d ndarray input, the default of None behaves like ``copy=False``.
    If data is a dict containing one or more Series (possibly of different dtypes),
    ``copy=False`` will ensure that these inputs are not copied.

SyntaxError: invalid decimal literal (171656810.py, line 40)

**Step-2: Create a Df using list**

In [2]:
names=['Ramesh','Suresh','Sathish']
#pd.DataFrame(data,index,columns)
pd.DataFrame(names)

         0
0   Ramesh
1   Suresh
2  Sathish

**Step-3: I want to change the index**

In [4]:
names=['Ramesh','Suresh','Sathish']
ids=['A','B','C']
pd.DataFrame(names,ids)
# pd.DataFrame(data,index)

         0
A   Ramesh
B   Suresh
C  Sathish

**Step-4: add the columns**

In [6]:
names=['Ramesh','Suresh','Sathish']
ids=['A','B','C']
cols=['Names']
pd.DataFrame(names,ids,cols)

     Names
A   Ramesh
B   Suresh
C  Sathish

**Step-5: Data and columns**

In [8]:
names=['Ramesh','Suresh','Sathish']
cols=['Names']
pd.DataFrame(names,columns=cols)

     Names
0   Ramesh
1   Suresh
2  Sathish

**Step-6: Multiple columns**

In [3]:
names=['Ramesh','Suresh','Sathish']
age=[20,22,24]
cols=['Names','Age']
df=pd.DataFrame(zip(names,age),
             columns=cols)
# pd.DataFrame(data,index)
df

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

**Step-7: Add a new column to already existing df dataframe**

- in above first we have taken data

- then created a dataframe

- now we want to add new data based on requirement

In [10]:
city=['Hyd','Pune','Blr']
df['City']=city
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [12]:
df['Marks']=[20,30,40]
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd     20
1   Suresh   22  Pune     30
2  Sathish   24   Blr     40

**Step-8: Update the column with new values**

In [13]:
df['Marks']=[200,300,400]
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    200
1   Suresh   22  Pune    300
2  Sathish   24   Blr    400

**Step-9: create empty dataframe and add the columns**

In [4]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Sathish']
df['Age']=[20,22,24]
df['City']=['Hyd','Pune','Blr']
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

**Step-10: Create a df using dictionary**

In [16]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,22,24],
   'City':['Hyd','Blr','Pune']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [18]:
d={'Name':'Ramesh',
  'Age':20}
print(d)
pd.DataFrame(d)

{'Name': 'Ramesh', 'Age': 20}

ValueError: If using all scalar values, you must pass an index

In [19]:
d={'Name':'Ramesh',
  'Age':20}
pd.DataFrame(d,index=[0])

     Name  Age
0  Ramesh   20

**Step-11:Save the dataframe**

In [21]:
# file handling session
# directory//filename.ext
# filename.ext
# we are saving dataframes
#    .csv  or  .xlsx 

df.to_csv('data.csv')

In [22]:
df.to_excel('data.xlsx')

In [26]:
# need a create a file and then drop it's path inside r""
df.to_csv(r'/Users/phani/Documents/Sai_Files/02Course_Files/07_Naresh_Data_Science/02FilesCreatedDuringSession/02Statistics/dataframes_saved/data.csv')

In [ ]:
df.to_csv(r'C:\Users\omkar\OneDrive\Documents\data.csv')

# 27/11/2025
**Step-12: Read the dataframe**

In [63]:
# in order to read the data
# filename.extension
# open(mbox-short.txt).read()
# open(mbox-short.txt,mode-'w').write('hello')

# data.csv.   data.xlsx
pd.read_csv('data.csv') #click tab after pd.re)

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   22   Blr
2           2  Sathish   24  Pune

In [65]:
pd.read_excel('data.xlsx')

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   22   Blr
2           2  Sathish   24  Pune

In [72]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,22,24],
   'City':['Hyd','Blr','Pune']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [ ]:
df.to_csv
pd.read_csv

df.to_excel
pd.read_excel

In [73]:
df.to_excel('data1.xlsx',index=False)

In [74]:
pd.read_excel('data1.xlsx')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [75]:
df.to_excel('data1.xlsx')

In [76]:
pd.read_excel('data1.xlsx')

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   22   Blr
2           2  Sathish   24  Pune

In [71]:
# add one more column marks to df
df['marks']=[100,200,300]
df

     Names  Age  City  marks
0   Ramesh   20   Hyd    100
1   Suresh   22   Blr    200
2  Sathish   24  Pune    300

In [7]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Sathish']
df['Age']=[20,22,24]
df['City']=['Hyd','Pune','Blr']
df['Marks']=[200,300,400]
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    200
1   Suresh   22  Pune    300
2  Sathish   24   Blr    400

**Step-13: Drop the column**
- labels
- axis
- index
- columns
- inplace

In [8]:
# if I want to drop a index, i need to use index argument name
df.drop(columns='Marks')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [9]:
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    200
1   Suresh   22  Pune    300
2  Sathish   24   Blr    400

In [10]:
df.drop(columns=['City','Marks'])

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

In [11]:
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    200
1   Suresh   22  Pune    300
2  Sathish   24   Blr    400

In [13]:
df.drop(index=1)

     Names  Age City  Marks
0   Ramesh   20  Hyd    200
2  Sathish   24  Blr    400

In [15]:
df.drop(1) # if I don't give index, label will be considered automatically

     Names  Age City  Marks
0   Ramesh   20  Hyd    200
2  Sathish   24  Blr    400

In [14]:
df.drop(columns='Marks')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [16]:
df.drop('Marks')
# be default, label='marks'
# if you don't mention axis, be default axis=0. So, error comes as 'Marks' not found in axis=0

KeyError: "['Marks'] not found in axis"

In [17]:
df.drop('Marks',axis=0)
# be default, label='marks'
# if you don't mention axis, be default axis=0. So, error comes as 'Marks' not found in axis=0

KeyError: "['Marks'] not found in axis"

In [19]:
df.drop('Marks',axis=1)
# axis = 0 means index along vertical, axis=1 means columns along horizontal
# axis : {0 or 'index', 1 or 'columns'}, default 0
    # Whether to drop labels from the index (0 or 'index') or
    # columns (1 or 'columns').

# by default, label='marks'
# if you don't mention axis, be default axis=0. So, error comes as 'Marks' not found in axis=0

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

# inplace
- when we do the operation, the result output is not overwriting
- means the original dataframe is same as it is.
- in order to do change original dataframe, we need to use **inplace** =True
- be default inplace=False
- make **inplace=True** if you want to overwrite the result

In [21]:
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd    200
1   Suresh   22  Pune    300
2  Sathish   24   Blr    400

In [22]:
df.drop('Marks',axis=1,inplace=True)

In [23]:
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

**Step-14: Rename the column**

In [25]:
d={'City':'city'} # {old:new}
# df.rename(<mapper>,<axis>,<inplace>)
# Signature:
# df.rename(
#     mapper: 'Renamer | None' = None,
#     *,
#     index: 'Renamer | None' = None,
#     columns: 'Renamer | None' = None,
#     axis: 'Axis | None' = None,
#     copy: 'bool | None' = None,
#     inplace: 'bool' = False,
#     level: 'Level | None' = None,
#     errors: 'IgnoreRaise' = 'ignore',
# ) -> 'DataFrame | None'
# Docstring:
# Rename columns or index labels.

# Function / dict values must be unique (1-to-1). Labels not contained in
# a dict / Series will be left as-is. Extra labels listed don't throw an
# error.

In [26]:
d={'City':'city'} # {old:new}
df.rename(d,axis=1,inplace=True)

In [27]:
df

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   22  Pune
2  Sathish   24   Blr

In [32]:
# create one more df
# x is 1 to 10
# y is square of x
# z is cube of x
x_list = list(range(1,11))
y_list= [i*i for i in x_list]
z_list= [i*i*i for i in x_list]
df=pd.DataFrame()
names=['Ramesh','Suresh','Sathish']
cols=['X','Y','Z']
df=pd.DataFrame(zip(x_list,y_list,z_list),index=x_list,columns=cols)
df

     X    Y     Z
1    1    1     1
2    2    4     8
3    3    9    27
4    4   16    64
5    5   25   125
6    6   36   216
7    7   49   343
8    8   64   512
9    9   81   729
10  10  100  1000

In [77]:
# create one more df
# x is 1 to 10
# y is square of x
# z is cube of x
x_list = list(range(1,11))
y_list= [i*i for i in x_list]
z_list= [i*i*i for i in x_list]
df=pd.DataFrame()
names=['Ramesh','Suresh','Sathish']
cols=['X','Y','Z']
df=pd.DataFrame(zip(x_list,y_list,z_list),columns=cols)
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

# Operations on pandas dataframe
- len(df)
- shape : df.shape
- size : df.size
- head : df.head
- tail : df.tail
- isnull : df.isnull
- dtypes : df.stypes
- info : df.info

In [78]:
len(df)

10

In [37]:
x_list = list(range(1,11))
y_list= [i*i for i in x_list]
z_list= [i*i*i for i in x_list]
df=pd.DataFrame()
names=['Ramesh','Suresh','Sathish']
cols=['X','Y','Z']
df=pd.DataFrame(zip(x_list,y_list,z_list),columns=cols)
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [38]:
df.shape

(10, 3)

In [39]:
df.size

30

In [40]:
df.head

<bound method NDFrame.head of     X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000>

In [41]:
df.head()

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [42]:
df.tail

<bound method NDFrame.tail of     X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000>

In [43]:
df.tail()

    X    Y     Z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [44]:
df.isnull

<bound method DataFrame.isnull of     X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000>

In [45]:
df.isnull()

       X      Y      Z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [51]:
df.isnull().sum()

X    0
Y    0
Z    0
dtype: int64

In [53]:
df.dtypes
# if any cat columns occurs

X    int64
Y    int64
Z    int64
dtype: object

In [48]:
df.info

<bound method DataFrame.info of     X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000>

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       10 non-null     int64
 1   Y       10 non-null     int64
 2   Z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

**Step-15: Select a column**
-

In [54]:
df['X'].shape

(10,)

In [58]:
df #selecting dataframe

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [56]:
df['X'] #selecting a particular column

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [57]:
df['X'].values #extraction data of columns

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [62]:
df['X'].values.tolist() #extraction data of columns

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [59]:
df[['X','Y']]

    X    Y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [60]:
df[['X','Y']].values

array([[  1,   1],
       [  2,   4],
       [  3,   9],
       [  4,  16],
       [  5,  25],
       [  6,  36],
       [  7,  49],
       [  8,  64],
       [  9,  81],
       [ 10, 100]])

In [61]:
df[['X','Y']].values.tolist()

[[1, 1],
 [2, 4],
 [3, 9],
 [4, 16],
 [5, 25],
 [6, 36],
 [7, 49],
 [8, 64],
 [9, 81],
 [10, 100]]